# IMPORTAR LIBRERIAS

In [1]:
import mysql.connector as con
import pandas as pd
import pymysql # Para ver la versión
import sqlalchemy # Para ver la versión
from sqlalchemy import create_engine

In [2]:
print(f"Conector: {con.__version__}")
print(f"Pandas: {pd.__version__}")
print(f"pymysql: {pymysql.__version__}")
print(f"sqlalchemy: {sqlalchemy.__version__}")

Conector: 9.1.0
Pandas: 2.2.3
pymysql: 1.4.6
sqlalchemy: 2.0.37

# PARTE 1: CREAR BASE DE DATOS Y CREAR TABLAS

Código SQL para la creacion de base de datos y tablas

In [3]:
sql_creacion = """ 
DROP DATABASE IF EXISTS supermercado;

CREATE DATABASE IF NOT EXISTS supermercado;

USE supermercado;

CREATE TABLE IF NOT EXISTS tiendas (
    id_tienda INT AUTO_INCREMENT PRIMARY KEY,
    nombre_tienda VARCHAR(100),
    direccion VARCHAR(255),
    ciudad VARCHAR(50)
);

CREATE TABLE IF NOT EXISTS empleados (
    id_empleado INT AUTO_INCREMENT PRIMARY KEY,
    nombre_empleado VARCHAR(100),
    puesto VARCHAR(50),
    id_tienda INT NOT NULL,
    FOREIGN KEY (id_tienda) REFERENCES tiendas (id_tienda)
);

CREATE TABLE IF NOT EXISTS categorias (
    id_categoria INT AUTO_INCREMENT PRIMARY KEY,
    nombre_categoria VARCHAR(50)
);

CREATE TABLE IF NOT EXISTS productos (
    id_producto INT AUTO_INCREMENT PRIMARY KEY,
    nombre_producto VARCHAR(100),
    precio DECIMAL(5, 2),
    stock INT,
    id_categoria INT NOT NULL,
    FOREIGN KEY (id_categoria) REFERENCES categorias (id_categoria)
);

CREATE TABLE IF NOT EXISTS clientes (
    id_cliente INT AUTO_INCREMENT PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    email VARCHAR(255),
    codigo_postal INT(5)
);

CREATE TABLE IF NOT EXISTS ordenes (
    id_orden INT AUTO_INCREMENT PRIMARY KEY,
    id_cliente INT NOT NULL,
    id_empleado INT NOT NULL,
    fecha_orden DATETIME,
    metodo_pago ENUM('Tarjeta', 'Efectivo'),
    FOREIGN KEY (id_cliente) REFERENCES clientes (id_cliente),
    FOREIGN KEY (id_empleado) REFERENCES empleados (id_empleado)
);

CREATE TABLE IF NOT EXISTS detalle_orden (
    id_detalle INT AUTO_INCREMENT PRIMARY KEY,
    id_orden INT NOT NULL,
    id_producto INT NOT NULL,
    cantidad INT,
    precio_unitario DECIMAL(5, 2), -- mismo precio que en la tabla producto
    descuento DECIMAL(3, 2),
    FOREIGN KEY (id_orden) REFERENCES ordenes (id_orden),
    FOREIGN KEY (id_producto) REFERENCES productos (id_producto)
);
"""

Conexión a MySQL y ejecución de codigo de creacion

In [4]:
connection = con.connect(
    host="localhost",
    port= "3306",
    user= "root",
    password= "admin"
)

cursor = connection.cursor()
cursor.execute(sql_creacion)
cursor.close()
connection.close()

# PARTE 2: GENERAR DATOS DEMO DESDE PYTHON

In [5]:
import random

## TIENDAS

In [6]:
ciudades = ['Málaga', 'Madrid', 'San Sebastian']
brand = 'SUPER24H'
tipo_via = ['Plaza', 'Calle', 'Avenida']
nombres_calle = ['Costitución', 'Libertad', 'Conocimiento', 'Pacífico', 'América']
tienda = []
for ciudad in ciudades:
    for num in range(1,6):
        direccion = f"{random.choice(tipo_via)}, {random.choice(nombres_calle)}, {random.randint(1, 150)}"
        tienda.append([f'{brand}_{ciudad}_{num}', direccion, ciudad])

df_tienda = pd.DataFrame(tienda, columns=['nombre_tienda', 'direccion', 'ciudad'])
df_tienda=df_tienda.reset_index().rename({'index': 'id_tienda'}, axis=1)
df_tienda['id_tienda'] = df_tienda['id_tienda'] + 1
df_tienda

,id_tienda,nombre_tienda,direccion,ciudad
0,1,SUPER24H_Málaga_1,"Plaza, Libertad, 103",Málaga
1,2,SUPER24H_Málaga_2,"Plaza, Pacífico, 48",Málaga
2,3,SUPER24H_Málaga_3,"Avenida, Costitución, 20",Málaga
3,4,SUPER24H_Málaga_4,"Plaza, América, 78",Málaga
4,5,SUPER24H_Málaga_5,"Plaza, Pacífico, 111",Málaga
5,6,SUPER24H_Madrid_1,"Plaza, Costitución, 104",Madrid
6,7,SUPER24H_Madrid_2,"Calle, América, 104",Madrid
7,8,SUPER24H_Madrid_3,"Plaza, Pacífico, 51",Madrid
8,9,SUPER24H_Madrid_4,"Plaza, Libertad, 51",Madrid
9,10,SUPER24H_Madrid_5,"Avenida, América, 127",Madrid
10,11,SUPER24H_San Sebastian_1,"Calle, Conocimiento, 85",San Sebastian
11,12,SUPER24H_San Sebastian_2,"Avenida, América, 43",San Sebastian
12,13,SUPER24H_San Sebastian_3,"Calle, América, 30",San Sebastian
13,14,SUPER24H_San Sebastian_4,"Plaza, América, 29",San Sebastian
14,15,SUPER24H_San Sebastian_5,"Calle, América, 106",San Sebastian

## EMPLEADOS

In [7]:
def selec_puesto(num, puestos):
    if num < 5:
        return puestos[0]
    elif num < 10:
        return puestos[1]
    elif num < 15:
        return puestos[2]
    elif num < 19:
        return puestos[3]
    else:
        return puestos[4]

puestos = ['Cajero', 'Reponedor', 'Mozo de Almacen', 'Jefe de Seccion', 'Gerente']
nombres = ['Carolina', 'Cecilia', 'Alan', 'Kike', 'Panchi', 'Carlos', 'Carmen', 'Emilio', 'Jose Ignacio', 'Luis', 'Maria', 'Marino','Nerea','Noelia', 'Oscar', 'Pablo', 'Rafael']
apellidos = ['García', 'Martínez', 'López', 'Hernández', 'González', 'Pérez', 'Rodríguez', 'Sánchez', 'Ramírez', 'Torres', 'Flores', 'Rivera', 'Díaz', 'Cruz', 'Morales']
tiendas = df_tienda['id_tienda']
empleados = []

for tienda in tiendas:
    for num in range(20):
        nombre = f'{random.choice(nombres)} {random.choice(apellidos)} {random.choice(apellidos)}'
        puesto = selec_puesto(num, puestos)
        empleados.append([nombre, puesto, tienda])
        
df_empleados = pd.DataFrame(empleados, columns=['nombre_empleado', 'puesto', 'id_tienda'])
df_empleados=df_empleados.reset_index().rename({'index': 'id_empleado'}, axis=1)
df_empleados['id_empleado'] = df_empleados['id_empleado'] + 1
df_empleados

     id_empleado               nombre_empleado           puesto  id_tienda
0              1  Jose Ignacio González Rivera           Cajero          1
1              2           Luis Morales Rivera           Cajero          1
2              3         Carlos Rivera Sánchez           Cajero          1
3              4           Alan Martínez López           Cajero          1
4              5           Carmen Sánchez Díaz           Cajero          1
..           ...                           ...              ...        ...
295          296             Oscar Flores Díaz  Jefe de Seccion         15
296          297           Alan Torres Morales  Jefe de Seccion         15
297          298             Kike Pérez Flores  Jefe de Seccion         15
298          299             Panchi Pérez Cruz  Jefe de Seccion         15
299          300         Panchi González Pérez          Gerente         15

[300 rows x 4 columns]

## CATEGORIAS

In [8]:
categorias = [
    'Frutería',
    'Carnicería',
    'Pescadería',
    'Panadería y Pastelería',
    'Lácteos y Huevos',
    'Bebidas',
    'Droguería y Limpieza',
    'Conservas y Alimentos enlatados',
    'Congelados',
    'Alimentos Secos y Básicos'
]

df_categorias = pd.DataFrame(categorias, columns=['nombre_categoria'])
df_categorias=df_categorias.reset_index().rename({'index': 'id_categoria'}, axis=1)
df_categorias['id_categoria'] = df_categorias['id_categoria'] + 1
df_categorias

   id_categoria                 nombre_categoria
0             1                         Frutería
1             2                       Carnicería
2             3                       Pescadería
3             4           Panadería y Pastelería
4             5                 Lácteos y Huevos
5             6                          Bebidas
6             7             Droguería y Limpieza
7             8  Conservas y Alimentos enlatados
8             9                       Congelados
9            10        Alimentos Secos y Básicos

## PRODUCTOS

In [9]:
productos = {
    1: ['Manzanas', 'Plátanos', 'Naranjas', 'Lechugas'],  # Frutería
    2: ['Pollo', 'Ternera', 'Cerdo', 'Cordero'],           # Carnicería
    3: ['Merluza', 'Salmón', 'Atún', 'Calamares'],         # Pescadería
    4: ['Pan integral', 'Croissants', 'Donuts', 'Baguette'], # Panadería y Pastelería
    5: ['Leche', 'Queso', 'Yogur', 'Huevos'],              # Lácteos y Huevos
    6: ['Agua', 'Refrescos', 'Vino tinto', 'Cerveza'],     # Bebidas
    7: ['Detergente', 'Esponjas', 'Desinfectante', 'Papel higiénico'], # Droguería y Limpieza
    8: ['Atún enlatado', 'Sopa de tomate', 'Maíz dulce', 'Guisantes en conserva'], # Conservas y Alimentos enlatados
    9: ['Pizza congelada', 'Helado', 'Verduras congeladas', 'Nuggets de pollo'], # Congelados
    10: ['Arroz', 'Pasta', 'Lentejas', 'Harina']          # Alimentos Secos y Básicos
}

producto_completo = []

for categoria in df_categorias['id_categoria']:
    for producto in productos[categoria]:
        precio = round(random.uniform(0.50, 150.00), 2)
        stock = random.randint(0,500)
        producto_completo.append([producto, precio, stock, categoria])
        
df_productos = pd.DataFrame(producto_completo, columns=['nombre_producto','precio','stock', 'id_categoria'])
df_productos=df_productos.reset_index().rename({'index': 'id_producto'}, axis=1)
df_productos['id_producto'] = df_productos['id_producto'] + 1
df_productos

    id_producto        nombre_producto  precio  stock  id_categoria
0             1               Manzanas  148.65    499             1
1             2               Plátanos  118.26    355             1
2             3               Naranjas  128.84    195             1
3             4               Lechugas   54.20    461             1
4             5                  Pollo   64.19    198             2
5             6                Ternera  106.78    144             2
6             7                  Cerdo  107.69     12             2
7             8                Cordero   15.36    169             2
8             9                Merluza   26.82    340             3
9            10                 Salmón   39.27    448             3
10           11                   Atún   23.48    400             3
11           12              Calamares   96.20    492             3
12           13           Pan integral   83.61    448             4
13           14             Croissants   39.58     47             4
14           15                 Donuts   79.33    408             4
15           16               Baguette   87.53    277             4
16           17                  Leche   35.74    472             5
17           18                  Queso   72.23    108             5
18           19                  Yogur    7.40     61             5
19           20                 Huevos   76.08     84             5
20           21                   Agua   41.06    195             6
21           22              Refrescos   74.85    232             6
22           23             Vino tinto    5.60    408             6
23           24                Cerveza   33.81    335             6
24           25             Detergente   80.66    471             7
25           26               Esponjas   86.48    395             7
26           27          Desinfectante  125.27    109             7
27           28        Papel higiénico   43.46    123             7
28           29          Atún enlatado   23.46     28             8
29           30         Sopa de tomate  130.62    312             8
30           31             Maíz dulce  139.57    109             8
31           32  Guisantes en conserva  123.91     90             8
32           33        Pizza congelada   83.41    300             9
33           34                 Helado  140.25    181             9
34           35    Verduras congeladas   91.46    107             9
35           36       Nuggets de pollo   40.27    299             9
36           37                  Arroz   29.07    466            10
37           38                  Pasta  144.01    302            10
38           39               Lentejas   99.89    281            10
39           40                 Harina  116.00    253            10

## CLIENTES

In [10]:
nombres = ['Carolina', 'Cecilia', 'Alan', 'Kike', 'Panchi', 'Carlos', 'Carmen', 'Emilio', 'Jose Ignacio', 'Luis', 'Maria', 'Marino','Nerea','Noelia', 'Oscar', 'Pablo', 'Rafael']
apellidos = ['García', 'Martínez', 'López', 'Hernández', 'González', 'Pérez', 'Rodríguez', 'Sánchez', 'Ramírez', 'Torres', 'Flores', 'Rivera', 'Díaz', 'Cruz', 'Morales']
emails = ['gmail', 'yahoo', 'hotmail']
codigo_postal = [29000, 28000, 20000]

cliente = []

for num in range (2000):
    nombre = f'{random.choice(nombres)}'
    apellido = f'{random.choice(apellidos)} {random.choice(apellidos)}'
    email = f'{nombre.lower()}.{apellido.split()[0][:1].lower()}{apellido.split()[1][:1].lower()}@{random.choice(emails)}.com'
    cp = random.choice(codigo_postal) + random.randint(1, 25)
    cliente.append([nombre, apellido, email, cp])
    
df_clientes = pd.DataFrame(cliente, columns=['first_name','last_name','email','codigo_postal'])
df_clientes=df_clientes.reset_index().rename({'index': 'id_cliente'}, axis=1)
df_clientes['id_cliente'] = df_clientes['id_cliente'] + 1
df_clientes

,id_cliente,first_name,last_name,email,codigo_postal
0,1,Carlos,Rivera González,carlos.rg@yahoo.com,29019
1,2,Marino,Flores Martínez,marino.fm@yahoo.com,29018
2,3,Cecilia,González Martínez,cecilia.gm@hotmail.com,29010
3,4,Maria,Hernández Ramírez,maria.hr@yahoo.com,20008
4,5,Pablo,Rodríguez Rodríguez,pablo.rr@gmail.com,29023
...,...,...,...,...,...
1995,1996,Carolina,Flores Sánchez,carolina.fs@hotmail.com,20008
1996,1997,Carmen,Díaz González,carmen.dg@yahoo.com,20005
1997,1998,Alan,Torres Díaz,alan.td@gmail.com,28011
1998,1999,Rafael,Rodríguez Rivera,rafael.rr@hotmail.com,29008
1999,2000,Carmen,López Cruz,carmen.lc@hotmail.com,20022

## ORDENES

In [11]:
import datetime
from datetime import datetime, timedelta

clientes = df_clientes['id_cliente']
empleados = df_empleados['id_empleado']
ordenes = []

fecha_inicial = datetime(year=2017, month=1, day=2, hour=9, minute=00)
for orden in range (10000):
    cliente = int(random.choice(clientes))
    empleado = int(random.choice(empleados))
    fecha = fecha_inicial + timedelta(minutes=30*orden)
    metodo = random.choice(['Tarjeta', 'Efectivo'])
    ordenes.append([cliente, empleado, fecha, metodo])
    
df_ordenes = pd.DataFrame(ordenes, columns=['id_cliente','id_empleado', 'fecha_orden', 'metodo_pago'])
df_ordenes=df_ordenes.reset_index().rename({'index': 'id_orden'}, axis=1)
df_ordenes['id_orden'] = df_ordenes['id_orden'] + 1
df_ordenes

      id_orden  id_cliente  id_empleado         fecha_orden metodo_pago
0            1        1350            1 2017-01-02 09:00:00    Efectivo
1            2         720          243 2017-01-02 09:30:00    Efectivo
2            3         552          200 2017-01-02 10:00:00     Tarjeta
3            4        1051           54 2017-01-02 10:30:00    Efectivo
4            5        1764          163 2017-01-02 11:00:00    Efectivo
...        ...         ...          ...                 ...         ...
9995      9996        1064          189 2017-07-29 14:30:00    Efectivo
9996      9997        1451          269 2017-07-29 15:00:00     Tarjeta
9997      9998         228          293 2017-07-29 15:30:00     Tarjeta
9998      9999        1574           33 2017-07-29 16:00:00     Tarjeta
9999     10000         638          230 2017-07-29 16:30:00    Efectivo

[10000 rows x 5 columns]

## DETALLE ORDEN

In [12]:
productos = df_productos['id_producto']
ordenes = df_ordenes['id_orden']
detalles = []

for orden in ordenes:
    for num in range(1, 4):
        producto = int(random.choice(productos))
        cantidad = random.randint(1,20)
        descuento = float(round(random.uniform(0.00, 5.00), 2))
        precio = float(round(df_productos['precio'][df_productos['id_producto'] == producto].iloc[0]))
        detalles.append([orden, producto, cantidad, precio, descuento])
        
df_detalles_orden = pd.DataFrame(detalles, columns=['id_orden','id_producto', 'cantidad', 'precio_unitario', 'descuento'])
df_detalles_orden=df_detalles_orden.reset_index().rename({'index': 'id_detalle'}, axis=1)
df_detalles_orden['id_detalle'] = df_detalles_orden['id_detalle'] + 1
df_detalles_orden

       id_detalle  id_orden  id_producto  cantidad  precio_unitario  descuento
0               1         1           23         6              6.0       1.74
1               2         1           37         8             29.0       1.71
2               3         1            8        12             15.0       2.01
3               4         2            2         4            118.0       0.14
4               5         2           20         8             76.0       0.77
...           ...       ...          ...       ...              ...        ...
29995       29996      9999           38        19            144.0       4.02
29996       29997      9999           33        11             83.0       0.59
29997       29998     10000            1        20            149.0       3.70
29998       29999     10000           16        11             88.0       2.04
29999       30000     10000           21         7             41.0       1.75

[30000 rows x 6 columns]

## CARGA DE DATOS CON PANDAS

Crear la conexion

In [13]:
user = "root"
password = "admin"
database = "supermercado"

# Crear la conexión
engine = create_engine(f"mysql+pymysql://{user}:{password}@localhost/{database}")

# Abrir una conección
connection = engine.connect()

# Cerrar la conección
connection.close()

Carga de datos

In [14]:
df_tienda.to_sql(name = "tiendas", con = engine, if_exists = "append", index = False)
df_empleados.to_sql(name = "empleados", con = engine, if_exists = "append", index = False)
df_categorias.to_sql(name = "categorias", con = engine, if_exists = "append", index = False)
df_productos.to_sql(name = "productos", con = engine, if_exists = "append", index = False)
df_clientes.to_sql(name = "clientes", con = engine, if_exists = "append", index = False)
df_ordenes.to_sql(name = "ordenes", con = engine, if_exists = "append", index = False)
df_detalles_orden.to_sql(name = "detalle_orden", con = engine, if_exists = "append", index = False)

30000

# PARTE 3: CONSULTAS SQL

1. Listado de órdenes con detalles de cliente y empleado
* Muestra el ID de la orden, la fecha, el nombre del cliente, el nombre del empleado que atendió la compra y el método de pago.
* Utiliza un JOIN entre las tablas ordenes, clientes y empleados.

In [15]:
sql = """ 
SELECT 
	o.id_orden, 
    o.fecha_orden, 
    concat(c.first_name, ' ', c.last_name) AS nombre_cliente,
    e.nombre_empleado,
    o.metodo_pago
FROM
	ordenes o
JOIN
	clientes c on o.id_cliente = c.id_cliente
JOIN
	empleados e on o.id_empleado = e.id_empleado;
"""

df = pd.read_sql(sql, engine)

df

,id_orden,fecha_orden,nombre_cliente,nombre_empleado,metodo_pago
0,1,2017-01-02 09:00:00,Maria Flores Hernández,Jose Ignacio González Rivera,Efectivo
1,98,2017-01-04 09:30:00,Alan Pérez Rivera,Jose Ignacio González Rivera,Efectivo
2,476,2017-01-12 06:30:00,Carolina Rivera Flores,Jose Ignacio González Rivera,Efectivo
3,734,2017-01-17 15:30:00,Luis López Torres,Jose Ignacio González Rivera,Tarjeta
4,1386,2017-01-31 05:30:00,Carlos Martínez López,Jose Ignacio González Rivera,Tarjeta
...,...,...,...,...,...
9995,9431,2017-07-17 20:00:00,Pablo González Hernández,Panchi González Pérez,Efectivo
9996,9484,2017-07-18 22:30:00,Carolina Martínez Ramírez,Panchi González Pérez,Tarjeta
9997,9520,2017-07-19 16:30:00,Carlos Pérez Flores,Panchi González Pérez,Tarjeta
9998,9987,2017-07-29 10:00:00,Nerea Ramírez Ramírez,Panchi González Pérez,Tarjeta
9999,9995,2017-07-29 14:00:00,Carmen Hernández Cruz,Panchi González Pérez,Efectivo


2. Productos con stock bajo
* Filtra aquellos productos cuyo stock sea menor a 10.
* Muestra nombre del producto, categoría y stock.

In [16]:
sql = """ 
SELECT 
	p.nombre_producto, 
    c.nombre_categoria, 
    p.stock
FROM 
	productos p
JOIN
	categorias c on p.id_categoria = c.id_categoria
WHERE p.stock < 10;
"""

df = pd.read_sql(sql, engine)

df

Empty DataFrame
Columns: [nombre_producto, nombre_categoria, stock]
Index: []

3. Ventas totales por categoría
* Muestra el nombre de la categoría y la suma total de las ventas (ej.: multiplicando cantidad * precio_unitario) para cada categoría.
* Realiza el JOIN con detalle_orden, productos y categorias.
* Utiliza agrupación (GROUP BY).

In [17]:
sql = """ 
SELECT
	c.nombre_categoria, sum(d.precio_unitario*d.cantidad) as Venta_Total
FROM
	productos p
JOIN
	categorias c on p.id_categoria = c.id_categoria
JOIN
	detalle_orden d on p.id_producto = d.id_producto
GROUP BY c.nombre_categoria
"""

df = pd.read_sql(sql, engine)

df

                  nombre_categoria  Venta_Total
0                         Frutería    3473581.0
1                       Carnicería    2386594.0
2                       Pescadería    1471118.0
3           Panadería y Pastelería    2241712.0
4                 Lácteos y Huevos    1490709.0
5                          Bebidas    1249769.0
6             Droguería y Limpieza    2640314.0
7  Conservas y Alimentos enlatados    3316998.0
8                       Congelados    2823106.0
9        Alimentos Secos y Básicos    3174407.0

4. Clientes con mayores gastos acumulados
* Muestra el nombre del cliente y el monto total que ha gastado (suma de todas sus órdenes).
* Asegúrate de tener en cuenta posibles descuentos (descuento) si se ha definido. Por ejemplo, la fórmula podría ser (cantidad * precio_unitario) - descuento.
* Ordena el resultado de mayor a menor gasto acumulado.

In [18]:
sql = """ 
SELECT 
	concat(c.first_name, ' ', c.last_name) AS nombre_cliente,
    sum((d.precio_unitario*d.cantidad)-d.descuento) as Gasto_Total_Con_Descuento,
    sum(d.precio_unitario*d.cantidad) as Gasto_Total_Sin_Descuento
FROM 
	ordenes o
JOIN
	clientes c on o.id_cliente = c.id_cliente
JOIN
	detalle_orden d on o.id_orden = d.id_orden
GROUP BY nombre_cliente
ORDER BY Gasto_Total_Con_Descuento DESC;
"""

df = pd.read_sql(sql, engine)

df

,nombre_cliente,Gasto_Total_Con_Descuento,Gasto_Total_Sin_Descuento
0,Jose Ignacio Torres González,67893.78,68088.0
1,Luis García González,58519.65,58719.0
2,Carolina Rodríguez Rivera,56764.38,56922.0
3,Marino Martínez Pérez,55761.21,55930.0
4,Oscar Martínez Pérez,54888.66,55054.0
...,...,...,...
1548,Rafael Cruz Pérez,1418.38,1428.0
1549,Carmen Cruz Torres,1285.49,1292.0
1550,Carmen Torres Sánchez,795.87,803.0
1551,Pablo Rivera Ramírez,698.87,705.0
1552,Alan González García,575.17,585.0

5. Empleados y número de órdenes gestionadas
* Muestra el nombre del empleado, el puesto y la cantidad de órdenes que ha gestionado.
* Utiliza GROUP BY y COUNT.

In [19]:
sql = """ 
SELECT
	e.nombre_empleado, 
    e.puesto, 
    count(o.id_empleado) as gestionadas
FROM 
	empleados e
JOIN
	ordenes o on e.id_empleado=o.id_empleado
GROUP BY e.nombre_empleado, e.puesto
"""

df = pd.read_sql(sql, engine)

df

                  nombre_empleado           puesto  gestionadas
0    Jose Ignacio González Rivera           Cajero           39
1             Luis Morales Rivera           Cajero           30
2           Carlos Rivera Sánchez           Cajero           29
3             Alan Martínez López           Cajero           33
4             Carmen Sánchez Díaz           Cajero           37
..                            ...              ...          ...
294             Oscar Flores Díaz  Jefe de Seccion           38
295           Alan Torres Morales  Jefe de Seccion           29
296             Kike Pérez Flores  Jefe de Seccion           29
297             Panchi Pérez Cruz  Jefe de Seccion           31
298         Panchi González Pérez          Gerente           44

[299 rows x 3 columns]

6. Ordenes filtradas por fecha y tienda
* Muestra todas las órdenes que se realizaron en un rango de fechas determinado (ej.: del 1 de enero de 2025 al 31 de enero de 2025) y en una tienda específica.
* Incluye datos de la tienda y del cliente.

In [20]:
sql = """ 
SELECT 
	t.nombre_tienda, 
	concat(c.first_name, ' ', c.last_name) AS nombre_cliente,
    o.*
FROM 
	ordenes o
JOIN 
	clientes c on o.id_cliente = c.id_cliente
JOIN
	empleados e on o.id_empleado = e.id_empleado
JOIN
	tiendas t on e.id_tienda = t.id_tienda
WHERE o.fecha_orden > "2017-01-31 23:59:00" AND o.fecha_orden < "2017-03-01";
"""

df = pd.read_sql(sql, engine)

df

,nombre_tienda,nombre_cliente,id_orden,id_cliente,id_empleado,fecha_orden,metodo_pago
0,SUPER24H_Málaga_1,Kike González González,1694,704,1,2017-02-06 15:30:00,Tarjeta
1,SUPER24H_Málaga_1,Carolina Rodríguez Martínez,1947,1038,1,2017-02-11 22:00:00,Tarjeta
2,SUPER24H_Málaga_1,Carmen Hernández Rivera,2000,743,1,2017-02-13 00:30:00,Tarjeta
3,SUPER24H_Málaga_1,Pablo Rodríguez Rodríguez,2043,5,1,2017-02-13 22:00:00,Tarjeta
4,SUPER24H_Málaga_1,Maria González Hernández,2047,443,1,2017-02-14 00:00:00,Efectivo
...,...,...,...,...,...,...,...
1339,SUPER24H_San Sebastian_5,Luis Morales Díaz,1550,1300,300,2017-02-03 15:30:00,Tarjeta
1340,SUPER24H_San Sebastian_5,Carmen Cruz Díaz,1575,997,300,2017-02-04 04:00:00,Efectivo
1341,SUPER24H_San Sebastian_5,Jose Ignacio Martínez Díaz,1811,1289,300,2017-02-09 02:00:00,Efectivo
1342,SUPER24H_San Sebastian_5,Kike Martínez Ramírez,2049,113,300,2017-02-14 01:00:00,Efectivo
1343,SUPER24H_San Sebastian_5,Emilio Morales Morales,2141,1924,300,2017-02-15 23:00:00,Tarjeta

7. Ranking de productos más vendidos en cada tienda
* Para cada tienda, muestra los 3 productos más vendidos (en términos de cantidad total).
* Tendrás que unir tiendas, empleados, ordenes y detalle_orden, además de productos.
* Usa GROUP BY y ordena por la cantidad sumada (y opcionalmente, un LIMIT 3).

In [21]:
sql = """ 
SELECT
	nombre_tienda,
    nombre_producto,
    cantidad_total
FROM(
	SELECT 
		ROW_NUMBER() OVER (PARTITION BY t.nombre_tienda ORDER BY sum(d.cantidad) DESC) AS rn,
		t.nombre_tienda,
		p.nombre_producto,
		sum(d.cantidad) AS cantidad_total
	FROM
		tiendas t
	JOIN 
		empleados e on t.id_tienda = e.id_tienda
	JOIN
		ordenes o on e.id_empleado = o.id_empleado
	JOIN
		detalle_orden d on o.id_orden = d.id_orden
	JOIN
		productos p on d.id_producto = p.id_producto
	GROUP BY t.nombre_tienda, p.nombre_producto) as ranking
    WHERE rn <= 3
    ORDER BY nombre_tienda, cantidad_total DESC;
"""

df = pd.read_sql(sql, engine)

df

               nombre_tienda      nombre_producto  cantidad_total
0          SUPER24H_Madrid_1                Cerdo           708.0
1          SUPER24H_Madrid_1              Ternera           703.0
2          SUPER24H_Madrid_1            Calamares           700.0
3          SUPER24H_Madrid_2      Papel higiénico           609.0
4          SUPER24H_Madrid_2             Lechugas           583.0
5          SUPER24H_Madrid_2  Verduras congeladas           581.0
6          SUPER24H_Madrid_3                Queso           851.0
7          SUPER24H_Madrid_3              Ternera           747.0
8          SUPER24H_Madrid_3             Plátanos           706.0
9          SUPER24H_Madrid_4                Leche           736.0
10         SUPER24H_Madrid_4            Calamares           717.0
11         SUPER24H_Madrid_4               Salmón           704.0
12         SUPER24H_Madrid_5                 Agua           686.0
13         SUPER24H_Madrid_5           Croissants           682.0
14         SUPER24H_Madrid_5                Pasta           681.0
15         SUPER24H_Málaga_1              Merluza           703.0
16         SUPER24H_Málaga_1  Verduras congeladas           652.0
17         SUPER24H_Málaga_1              Ternera           636.0
18         SUPER24H_Málaga_2             Lentejas           758.0
19         SUPER24H_Málaga_2           Vino tinto           740.0
20         SUPER24H_Málaga_2              Merluza           661.0
21         SUPER24H_Málaga_3           Detergente           654.0
22         SUPER24H_Málaga_3            Refrescos           653.0
23         SUPER24H_Málaga_3               Huevos           601.0
24         SUPER24H_Málaga_4               Harina           754.0
25         SUPER24H_Málaga_4           Croissants           672.0
26         SUPER24H_Málaga_4                Arroz           670.0
27         SUPER24H_Málaga_5            Refrescos           688.0
28         SUPER24H_Málaga_5           Vino tinto           626.0
29         SUPER24H_Málaga_5                Arroz           619.0
30  SUPER24H_San Sebastian_1  Verduras congeladas           618.0
31  SUPER24H_San Sebastian_1        Desinfectante           601.0
32  SUPER24H_San Sebastian_1     Nuggets de pollo           596.0
33  SUPER24H_San Sebastian_2        Desinfectante           746.0
34  SUPER24H_San Sebastian_2              Ternera           703.0
35  SUPER24H_San Sebastian_2             Lentejas           702.0
36  SUPER24H_San Sebastian_3                Cerdo           781.0
37  SUPER24H_San Sebastian_3             Esponjas           756.0
38  SUPER24H_San Sebastian_3             Baguette           688.0
39  SUPER24H_San Sebastian_4                Pasta           688.0
40  SUPER24H_San Sebastian_4                Cerdo           645.0
41  SUPER24H_San Sebastian_4           Maíz dulce           628.0
42  SUPER24H_San Sebastian_5      Pizza congelada           712.0
43  SUPER24H_San Sebastian_5            Refrescos           680.0
44  SUPER24H_San Sebastian_5     Nuggets de pollo           677.0